{
    "appName": "Next Level",

    "messages": {
        "searchByGameName": "Buscar por nombre de juego..."
    },

    "successCodes": {
        "displayNameModified": "El nombre ha sido actualizado con éxito",
        "emailModified": "El correo ha sido actualizado con éxito",
        "passwordModified": "La contraseña ha sido actualizada con éxito",
        "userProfilePictureModified": "La foto de perfil ha sido actualizada con éxito"
    },

    "warningCodes": {

    },

    "errorCodes": {
        "authEmailAlreadyInUse": "El email introducido ya está en uso",
        "authWrongPassword": "La contraseña introducida no es correcta",
        "authUserNotFound": "No existe ningún usuario asociado al email indicado",
        "default": "Ha ocurrido un error inesperado"
    },

    "menu": {
        "title": "Next Level",
        "profile": "Perfil",
        "board": "Mi tablón",
        "library": "Biblioteca",
        "played": "Jugados",
        "pending": "Pendientes",
        "lists": "Todas mis listas",
        "settings": "Ajustes",
        "information": "Información",
        "administration": "Administración"
    },

    "buttons": {
        "delete": "Eliminar",
        "logOut": "Cerrar sesión",
        "confirm": "Confirmar",
        "pending": "Pendiente",
        "playing": "Jugando",
        "completed": "Completado",
        "signUp": "Crear cuenta",
        "signUpHere": "¿No tienes cuenta? Crea una aquí",
        "signIn": "Iniciar sesión",
        "signInHere": "¿Ya tienes cuenta? Inicia sesión aquí",
        "signOut": "Cerrar sesión",
        "cancel": "Cancelar",
        "change": "Cambiar",
        "create": "Crear"
    },

    "loadingScreens": {
        "uploadingUserProfilePicture": "Subiendo nueva imagen de perfil",
        "signingUp": "Registrando",
        "signingIn": "Iniciando sesión",
        "loadingLists": "Cargando listas",
        "creatingList": "Añadiendo una nueva lista",
        "deletingList": "Borrando lista",
        "modifyingList": "Modificando lista",
        "addingGameToList": "Añadiendo juego a la lista",
        "loadingGameData": "Cargando datos del juego",
        "loadingGames": "Cargando juegos",
        "deletingGames": "Borrando juegos",
        "updatingName": "Actualizando nombre",
        "updatingEmail": "Actualizando email",
        "updatingPassword": "Actualizando contraseña",
        "updatingBoard": "Actualizando tablón",
        "loadingUsers": "Cargando usuarios",
        "loadingUser": "Cargando usuario",
        "modifyingUser": "Modificando usuario",
        "loadingLibrary": "Cargando biblioteca"
    },

    "signUp": {
        "name": "Nombre",
        "email": "Correo electrónico",
        "password": "Contraseña",
        "confirmPassword": "Confirmar contraseña"
    },

    "signIn": {
        "email": "Correo electrónico",
        "password": "Contraseña"
    },

    "profile": {
        "title": "Perfil",
        "welcome": "Bienvenido, {{name}}",
        "user": "@{{user}}",
        "changePassword": {
            "title": "Cambiar contraseña",
            "currentPassword": "Contraseña actual",
            "newPassword": "Nueva contraseña",
            "confirmPassword": "Confirmar contraseña"
        },
        "changeEmail": {
            "title": "Cambiar correo electrónico",
            "newEmailAddress": "Nueva dirección de correo",
            "confirmPassword": "Confirmar contraseña"
        },
        "changeName": {
            "title": "Cambiar nombre",
            "name": "Nombre completo"
        },
        "logOut": {
            "title": "Cerrar sesión",
            "logOutHeader": "¿Quieres cerrar la sesión?",
            "logOutBody": "Esperamos volver a verte muy pronto. Recuerda guardar tu contraseña en un lugar seguro para evitar olvidos."
        },
        "deleteAccount": {
            "title": "Eliminar cuenta",
            "deleteAccountHeader": "¿Quieres eliminar la cuenta?",
            "deleteAccountBody": "Ten presente que este cambio es irreversible. En cuanto lo hagas, ¡no habrá vuelta a trás!"
        }
    },

    "board": {
        "title": "Mi tablón",
        "addList": "Añade una lista",
        "createListNow": "¡Crea una ahora!",
        "addToBoard": {
            "addToBoardHeader": "Añade una lista al tablón",
            "addToBoardBody": "Selecciona una lista de las disponibles a continuación para añadirlas al tablón y poder acceder a su contenido fácilmente"
        },
        "deleteFromBoard": {
            "deleteFromBoardHeader": "¿Quieres quitar la lista del tablón?",
            "deleteFromBoardBody": "Tranquilo, puedes volver a añadirla en cualquier momento"
        },
        "emptyScreen": {
            "title": "Vaya...",
            "description": "Parece que esto está un poco vacío. ¿Por qué no pruebas a añadir alguna lista?",
            "buttonLabel": "Añadir una lista"
        }
    },

    "library": {
        "title": "Biblioteca",
        "createList": "Crear una lista",
        "addToList": {
            "title": "Añadir a la lista...",
            "addToListHeader": "Añadir juego a una lista",
            "addToListBody": "Selecciona cualquier lista de las que tengas creadas para añadirle este juego"
        },
        "emptyScreen": {
            "title": "Sin resultados",
            "description": "Parece que los parámetros de búsqueda que has introducido no han obtenido ningún resultado. ¿Por qué no purebas de nuevo?"
        }
    },

    "lists": {
        "title": "Todas mis listas",
        "list": {
            "newList": "Nueva lista",
            "listName": "Nombre de la lista",
            "changeName": "Cambiar nombre",
            "addToFavorites": "Añadir a favoritos",
            "removeFromFavorites": "Eliminar de favoritos",
            "selectGames": "Seleccionar juegos",
            "stopSelecting": "Dejar de seleccionar",
            "delete": "Borrar lista",
            "deleteList": {
                "deleteListHeader": "¿Quieres eliminar la lista?",
                "deleteListBody": "Ten presente que este cambio es irreversible. En cuanto lo hagas, ¡no habrá vuelta a trás!"
            },
            "deleteGames": {
                "deleteGamesHeader": "¿Quieres eliminar los juegos seleccionados?",
                "deleteGamesBody": "Ten presente que este cambio es irreversible. En cuanto lo hagas, ¡no habrá vuelta a trás!"
            },
            "emptyScreen": {
                "title": "Vaya...",
                "description": "Parece que esto está un poco vacío. ¿Por qué no pruebas a añadir algún juego desde la biblioteca?",
                "buttonLabel": "Añadir un juego"
            }
        },
        "emptyScreen": {
            "title": "Vaya...",
            "description": "Parece que esto está un poco vacío. ¿Por qué no pruebas a crear alguna lista?",
            "buttonLabel": "Crear una lista"
        }
    },

    "game": {
        "description": "Descripción",
        "platforms": "Plataformas",
        "metascore": "Metascore",
        "genres": "Géneros",
        "releaseDate": "Fecha de lanzamiento",
        "developer": "Desarrolladora",
        "publisher": "Editora",
        "ageRating": "Clasificación de edad",
        "userScore": "Mi valoración",
        "completed": "Completado",
        "paused": "En pausa",
        "playing": "Jugando",
        "addNote": "Añadir una nota",
        "saveNote": "Guardar nota",
        "yourNoteHere": "Tu nota aquí...",
        "myScore": "Mi valoración:"
    },

    "settings": {
        "title": "Ajustes",
        "appColor": "Color principal de la aplicación",
        "appTheme": "Tema",
        "appLanguage": "Idioma",
        "darkMode": "Modo oscuro",
        "languages": {
            "spanish": "Español",
            "english": "Inglés"
        },
        "colors": {
            "red": "Rojo",
            "orange": "Naranja",
            "yellow": "Amarillo",
            "green": "Verde",
            "blue": "Azul"
        }
    },

    "information": {
        "title": "Información",
        "supportMeOnKofi": "Apóyame en Ko-fi",
        "donateWithPaypal": "Dona a través de PayPal",
        "version": {
            "title": "Detalles de la versión"
        },
        "doYouLikeTheApp": {
            "title": "¿Te gusta la aplicación?",
            "firstParagraph": "No te olvides de puntuarla en tu tienda de aplicaciones preferida. Una buena puntuación me motiva a seguir con el desarrollo.",
            "secondParagraph": "Si lo deseas, también puedes apoyar al desarrollo invitándome a un café o haciendo una donación a través de PayPal. ¡Cualquier ayuda es bienvenida!"
        },
        "contact": {
            "title": "Contacto",
            "firstParagraph": "Sígueme en mis redes sociales para permanecer al tanto de los últimos avances en el desarrollo de la aplicación.",
            "twitter": "Sígueme en Twitter",
            "facebook": "Dame un Me gusta en Facebook",
            "instagram": "Sígueme en Instagram",
            "email": "Envíame un correo"
        },
        "legal": {
            "title": "Aviso legal",
            "terms": {
                "title": "1. Condiciones de Uso",
                "first": "La utilización de esta aplicación le otorga la condición de Usuario, e implica la aceptación completa de todas las cláusulas y condiciones de uso incluidas en las secciones:",
                "second": "Aviso Legal",
                "third": "Política de Privacidad",
                "fourth": "Política de Cookies",
                "fifth": "Si no estuviera conforme con todas y cada una de estas cláusulas y condiciones absténgase de utilizar esta aplicación.",
                "sixth": "El acceso a esta aplicación no supone, en modo alguno, el inicio de una relación comercial con el Titular.",
                "seventh": "A través de esta aplicación, el Titular le facilita el acceso y la utilización de diversos contenidos que el Titular o sus colaboradores han publicadon por medio de Internet.",
                "eighth": "A tal efecto, usted está obligado y comprometido a NO utilizar cualquiera de los contenidos de la aplicación con fines o efectos ilícitos, prohibidos en este Aviso Legal o por la legislación vigente, lesivos de los derechos e intereses de terceros, o que de cualquier forma puedan dañar, inutilizar, sobrecargar, deteriorar o impedir la normal utilización de los contenidos, los equipos informáticos o los documentos, archivos y toda clase de contenidos almacenados en cualquier equipo informático propios o contratados por el Titular, de otros usuarios o de cualquier usuario de Internet."
            },
            "security": {
                "title": "2. Medidas de seguridad",
                "first": "Los datos personales que facilite al Titular pueden ser almacenados en bases de datos automatizadas o no, cuya titularidad corresponde en exclusiva a el Titular, que asume todas las medidas de índole técnica, organizativa y de seguridad que garantizan la confidencialidad, integridad y calidad de la información contenida en las mismas de acuerdo con lo establecido en la normativa vigente en protección de datos.",
                "second": "No obstante, debe ser consciente de que las medidas de seguridad de los sistemas informáticos en Internet no son enteramente fiables y que, por tanto el Titular no puede garantizar la inexistencia de virus u otros elementos que puedan producir alteraciones en los sistemas informáticos (software y hardware) del Usuario o en sus documentos electrónicos y ficheros contenidos en los mismos aunque el Titular pone todos los medios necesarios y toma las medidas de seguridad oportunas para evitar la presencia de estos elementos dañinos."
            },
            "personal": {
                "title": "3. Datos personales",
                "first": "Usted puede consultar toda la información relativa al tratamiento de datos personales que recoge el Titular en la sección de la Política de Privacidad."
            },
            "contents": {
                "title": "4. Contenidos",
                "first": "El Titular ha obtenido la información, el contenido multimedia y los materiales incluidos en la aplicación de fuentes que considera fiables, pero, si bien ha tomado todas las medidas razonables para asegurar que la información contenida es correcta, el Titular no garantiza que sea exacta, completa o actualizada. El Titular declina expresamente cualquier responsabilidad por error u omisión en la información contenida en las secciones de esta aplicación.",
                "second": "Queda prohibido transmitir o enviar a través de la aplicación cualquier contenido ilegal o ilícito, virus informáticos, o mensajes que, en general, afecten o violen derechos de el Titular o de terceros.",
                "third": "Los contenidos de la aplicación tienen únicamente una finalidad informativa y bajo ninguna circunstancia deben usarse ni considerarse como oferta de venta, solicitud de una oferta de compra ni recomendación para realizar cualquier otra operación, salvo que así se indique expresamente.",
                "fourth": "El Titular se reserva el derecho a modificar, suspender, cancelar o restringir el contenido de la aplicación, los vínculos o la información obtenida a través de la aplicación, sin necesidad de previo aviso.",
                "fifth": "El Titular no es responsable de los daños y perjuicios que pudieran derivarse de la utilización de la información de la aplicación o de la contenida en las redes sociales del Titular."
            },
            "cookies": {
                "title": "5. Política de cookies",
                "first": "En esta sección puede consultar toda la información relativa a la política de recogida y tratamiento de las cookies.",
                "second": "El Titular sólo obtiene y conserva la siguiente información acerca de los usuarios de la aplicación:",
                "third": "El nombre de dominio del proveedor (PSI) y/o dirección IP que les da acceso a la red",
                "fourth": "La fecha y hora de acceso a la aplicación",
                "fifth": "El número de visitantes diarios de cada sección",
                "sixth": "La información obtenida es totalmente anónima, y en ningún caso puede ser asociada a un Usuario concreto e identificado"
            },
            "links": {
                "title": "6. Enlaces de interés a otros sitios Web",
                "first": "El Titular puede proporcionarle acceso a sitios Web de terceros mediante enlaces con la finalidad de informar sobre la existencia de otras fuentes de información en Internet en las que podrá ampliar los datos ofrecidos en la aplicación.",
                "second": "Estos enlaces a otros sitios Web no suponen en ningún caso una sugerencia o recomendación para que usted visite las páginas web de destino, que están fuera del control del Titular, por lo que Titular no es responsable del contenido de los sitios web vinculados ni del resultado que obtenga al seguir los enlaces.",
                "third": "Asimismo, el Titular no responde de los links o enlaces ubicados en los sitios web vinculados a los que le proporciona acceso.",
                "fourth": "El establecimiento del enlace no implica en ningún caso la existencia de relaciones entre Titular y el propietario del sitio en el que se establezca el enlace, ni la aceptación o aprobación por parte del Titular de sus contenidos o servicios.",
                "fifth": "Si accede a un sitio Web externo desde un enlace que encuentre en la aplicación usted deberá leer la propia política de privacidad del sitio web que puede ser diferente de la de esta aplicación."
            },
            "property": {
                "title": "7. Propiedad intelectual e industrial",
                "first": "Todos los derechos están reservados.",
                "second": "Todo acceso a esta aplicación está sujeto a las siguientes condiciones: la reproducción, almacenaje permanente y la difusión de los contenidos o cualquier otro uso que tenga finalidad pública o comercial queda expresamente prohibida sin el consentimiento previo expreso y por escrito de Titular."
            },
            "limited": {
                "title": "8. Limitación de responsabilidad",
                "first": "La información y servicios incluidos o disponibles a través de esta aplicación pueden incluir incorrecciones o errores tipográficos. De forma periódica el Titular incorpora mejoras y/o cambios a la información contenida y/o los Servicios que puede introducir en cualquier momento.",
                "second": "El Titular no declara ni garantiza que los servicios o contenidos sean interrumpidos o que estén libres de errores, que los defectos sean corregidos, o que el servicio o el servidor que lo pone a disposición estén libres de virus u otros componentes nocivos sin perjuicio de que el Titular realiza todos los esfuerzos en evitar este tipo de incidentes.",
                "third": "Titular declina cualquier responsabilidad en caso de que existan interrupciones o un mal funcionamiento de los Servicios o contenidos ofrecidos en Internet, cualquiera que sea su causa. Asimismo, el Titular no se hace responsable por caídas de la red, pérdidas de negocio a consecuencia de dichas caídas, suspensiones temporales de fluido eléctrico o cualquier otro tipo de daño indirecto que te pueda ser causado por causas ajenas a el Titular.",
                "fourth": "Antes de tomar decisiones y/o acciones con base a la información incluida en la aplicación, el Titular le recomienda comprobar y contrastar la información recibida con otras fuentes."
            },
            "jurisdiction": {
                "title": "9. Jurisdicción",
                "first": "Este Aviso Legal se rige íntegramente por la legislación española.",
                "second": "Siempre que no haya una norma que obligue a otra cosa, para cuantas cuestiones se susciten sobre la interpretación, aplicación y cumplimiento de este Aviso Legal, así como de las reclamaciones que puedan derivarse de su uso, las partes acuerdan someterse a los Jueces y Tribunales de la provincia de Santa Cruz de Tenerife, con renuncia expresa de cualquier otra jurisdicción que pudiera corresponderles."
            },
            "contact": {
                "title": "10. Contacto",
                "first": "En caso de que usted tenga cualquier duda acerca de estas Condiciones legales o quiera realizar cualquier comentario sobre este sitio Web, puede enviar un mensaje de correo electrónico a la dirección contact.nextlevelapp@gmail.com"
            }
        }
    },

    "administration": {
        "title": "Administración",
        "userAdministration": {
            "name": "Nombre",
            "uid": "Id",
            "email": "Correo electrónico",
            "role": {
                "title": "Rol del usuario",
                "user": "Usuario",
                "pro": "Pro",
                "admin": "Administrador"
            }
        }
    }

}
